// questions.js 題目檔案

const questions = [
    {
        text: "在同事（同學）眼中您是一位？",
        options: [
            "積極、熱情、有行動力的人。",
            "活潑、開朗、風趣幽默的人。",
            "忠誠、隨和、容易相處的人。",
            "謹慎、冷靜、注意細節的人。"
        ]
    },
    {
        text: "您喜歡看哪一類型的雜誌？",
        options: [
            "管理、財經、趨勢類。",
            "旅遊、美食、時尚類。",
            "心靈、散文、家庭類。",
            "科技、專業、藝術類。"
        ]
    },
    {
        text: "您做決策的方式？",
        options: [
            "希望能立即有效。",
            "感覺重於一切。",
            "有時間考慮或尋求他人意見。",
            "要有詳細的資料評估。"
        ]
    },
    {
        text: "職務上哪種工作是我最擅長的？",
        options: [
            "以目標為導向，有不服輸的精神。",
            "良好的口才，能主動的與人建立友善關係。",
            "能配合團隊，扮演忠誠的擁護者。",
            "流程的掌握，注意到細節。"
        ]
    },
    {
        text: "當面對壓力時，您會？",
        options: [
            "用行動力去面對它，並且克服它。",
            "希望找人傾吐，獲得認同。",
            "逆來順受，儘量避免衝突。",
            "重新思考緣由，必要時做精細的解說。"
        ]
    },
    {
        text: "與同事（同學）之間的相處？",
        options: [
            "以公事為主，很少談到個人生活。",
            "重視氣氛，能夠帶動團隊情趣。",
            "良好的傾聽者，對人態度溫和友善。",
            "被動，不會主動與人建立關係。"
        ]
    },
    {
        text: "您希望別人如何與您溝通？",
        options: [
            "直接講重點，不要拐彎抹角。",
            "輕鬆，不要太嚴肅。",
            "不要一次說太多，要給予明確的支持。",
            "凡事說清楚，講明白。"
        ]
    },
    {
        text: "要完成一件事情時，您最在意的部分是？",
        options: [
            "效果是否有達到。",
            "過程是否快樂。",
            "前後是否有改變。",
            "流程是否正確。"
        ]
    },
    {
        text: "什麼事情會讓您恐懼？",
        options: [
            "呈現弱點，被人利用。",
            "失去認同，被人排擠。",
            "過度變動，讓人無所適從。",
            "制度不清，標準不一。"
        ]
    },
    {
        text: "哪項是您自覺的缺點？",
        options: [
            "沒有耐心。",
            "欠缺細心。",
            "沒有主見。",
            "欠缺風趣。"
        ]
    },
    {
        text: "您最喜歡的工作環境為何？",
        options: [
            "具領導地位，可以自行作決策。",
            "受到同事的歡迎且和大家相處愉快。",
            "可以在穩定中持續成長。",
            "注重工作中各環節的規劃與品質。"
        ]
    },
    {
        text: "您的消費模式為何？",
        options: [
            "只看想要買的，選好就直接付錢。",
            "常因銷售員的親切與介紹而選擇購買的商品。",
            "找一些熟悉的店家去購買商品。",
            "著重於商品的成本與品質。"
        ]
    },
    {
        text: "當您要搭乘的電梯很擁擠時？",
        options: [
            "直接走入電梯，按電鈕把門關上。",
            "要其他人一起進來！告知一定還有地方站。",
            "耐心的排隊，從這一列移到下一列，且猶豫不決。",
            "走進電梯後，若感到很擠，會開始數人頭，若超過限制，就要人出電梯。"
        ]
    },
    {
        text: "您對於完成一件專案的原則是？",
        options: [
            "著重於結果。",
            "先了解由誰領導且重視專案的過程。",
            "問清楚處理步驟與方法後，開始執行。",
            "著重於專案內容的流程與品質。"
        ]
    },
    {
        text: "通常在團隊活動中，您的表現如何？",
        options: [
            "主動、積極，不在意他人的看法。",
            "喜歡招待別人，樂於和大家溝通。",
            "待人溫和有禮，但不主動。",
            "不喜歡向大眾表達自己的看法。"
        ]
    }
];
